# specify a directory to install
cask_args appdir: '/Applications'
tap "homebrew/bundle"

# Brew formulae
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "gh"
brew "iconsur"
brew "imagemagick"
brew "mackup"
brew "mas"
brew "mkcert"
brew "nvm"
brew "openconnect"
brew "openfortivpn"
brew "pnpm"
brew "wget"
brew "yy-dlp"
brew "zsh"

# Brew Casks
cask "1password" # requires license
cask "anybar"
cask "appcleaner"
cask "bankid"
cask "bartender" # requires license
cask "beeper"
cask "betterdisplay"
cask "browserino"
cask "chatgpt"
cask "cheatsheet"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "karabiner-elements"
cask "kap"
cask "keycastr"
cask "macpacker"
cask "messenger"
cask "ngrok"
cask "notion"
cask "opal-app"
cask "postman"
cask "quitter"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "termius"
cask "transmission"
cask "unlox"
cask "utm"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-monaspace"

# MacBook Pro 2011 Home Server
# cask "plex"
# cask "plex-media-server"
# cask "soda-player"

# Install from Mac App Store

mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Take a Break", id: 1457158844
mas "Things", id: 904280696
mas "The Unarchiver", id: 425424353

# Safari Extensions
mas "1Blocker", id: 1365531024
mas "1Password", id: 1569813296
mas "Grammarly Safari Extension", id: 1462114288
mas "PiPifier", id: 1160374471
mas "Super Agent", id: 1568262835

# Optional
# cascadea
# mas "Amphetamine", id: 937984704
# mas "Bredbandskollen", id: 1147976909
# mas "ColorSlurp", id: 1287239339
# mas "Day One", id: 1055511498
# mas "Hush Safari Extension", id: 1544743900
# mas "Paste", id: 967805235
# mas "Scenecuts Helper", id: 1540491573
# mas "Session Pomodoro Timer", id: 1521432881
# mas "Wappalyzer", id: 1520333300
