# specify a directory to install
cask_args appdir: '/Applications'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
brew "ffmpeg"
brew "gh"
brew "imagemagick"
brew "mas"
brew "node"
brew "openconnect"
# brew "terraform"
brew "youtube-dl"
brew "zplug"
brew "zsh"
cask "1password" # requires license
cask "anybar"
cask "bankid"
cask "bartender" # requires license
cask "browserosaurus"
# cask "caption"
# cask "catch"
# cask "cheatsheet"
cask "cleanmymac" # requires license
cask "docker"
cask "figma"
cask "flux"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
# cask "hazel" # requires license
cask "karabiner-elements"
cask "messenger"
cask "nightfall"
cask "notion"
cask "plex"
# cask "plex-media-server"
# cask "parallels" # requires license
cask "pika"
cask "postman"
cask "proxyman"
cask "quitter"
cask "rectangle"
cask "slack"
cask "soda-player"
cask "startupizer" # requires license
cask "tableplus" # requires pro license
cask "telegram-desktop"
cask "transmission"
cask "visual-studio-code"
cask "unlox"
# Fonts
cask "font-fira-code"
# Install from Mac App Store
mas "1Blocker", id: 1107421413
mas "Amphetamine", id: 937984704
mas "Bredbandskollen", id: 1147976909
mas "Dynamo Safari Extension", id: 1445910651
mas "Hush Safari Extension", id: 1544743900
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "PiPifier Safari Extension",id: 1160374471
mas "The Unarchiver", id: 425424353
mas "Reeder", id: 1449412482
mas "Scenecuts Helper", id: 1540491573
mas "Tab Suspender", id: 1495356253
mas "Take a Break", id: 1457158844
mas "Grammarly Safari Extension", id: 1462114288
mas "JSONPeep", id: 1458969831

# Optional
# cascadea
